MuditGoyal3156/STM32F446RE-Driver-Layer/stm32f4xx_drivers/Src/009i2c_master_tx_testing.c
/*
 * 009i2c_master_tx_testing.c
 *
 *  Created on: Dec 19, 2025
 *      Author: mudit
 */

#include "stm32f446xx.h"
#include <stdint.h>
#include <string.h>

#define MY_ADDR			0x61U
#define SLAVE_ADDR  	0x68U
void delay(void)
{
	for(uint32_t i = 0 ; i< 250000 ; i++);
}

I2C_Handle_t I2C1Handle;

uint8_t data[]="We are testing i2c master tx\n";//make sure this is less than 32 byte

/*
 * Alternate Function Mode : 4
 * PB6 --> SCL
 * PB7 --> SDA

 */

void I2C1_GPIOInits(void)
{
	GPIO_Handle_t I2CPins;

	I2CPins.pGPIOx = GPIOB;
	I2CPins.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
	I2CPins.GPIO_PinConfig.GPIO_PinAltFunMode = 4;
	I2CPins.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_OD;
	I2CPins.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PIN_PU;
	I2CPins.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;

	//SCL
	I2CPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_6;
	GPIO_Init(&I2CPins);

	//SDA
	I2CPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_7;
	GPIO_Init(&I2CPins);

}

void I2C1_Inits(void)
{
	I2C1Handle.pI2Cx = I2C1;
	I2C1Handle.I2C_Config.I2C_ACKControl = I2C_ACK_ENABLE;
	I2C1Handle.I2C_Config.I2C_DeviceAddress = MY_ADDR;
	I2C1Handle.I2C_Config.I2C_FMDutyCycle = I2C_FM_DUTY_2;
	I2C1Handle.I2C_Config.I2C_SCLSpeed = I2C_SCL_SPEED_SM;
	I2C_Init(&I2C1Handle);
}

void GPIO_ButtonInit(void)
{
	GPIO_Handle_t GPIObtn;
	GPIObtn.pGPIOx = GPIOC;
	GPIObtn.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_13;
	GPIObtn.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IN;
	GPIObtn.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	GPIObtn.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;

	GPIO_Init(&GPIObtn);
}

int main(void)
{
	GPIO_ButtonInit();

	//Configure the pins
	I2C1_GPIOInits();

	//Initialize the I2C peripheral
	I2C1_Inits();

	//Enable the peripheral
	I2C_PeripheralControl(I2C1,ENABLE);
	while(1)
	{
		//Wait for button press
		while((GPIO_ReadFromInputPin(GPIOC,GPIO_PIN_NO_13)));
		delay();
		//Send some data to slave
		I2C_MasterSendData(&I2C1Handle,data,strlen((char *)data),SLAVE_ADDR);

	}
}
